app/controllers/cars_controller.rb

  def index
    @cars = Car.all
---
SELECT "cars".* FROM "cars"

  def create
    @car = Car.new(car_params)

    respond_to do |format|
      if @car.save
---
INSERT INTO "cars" ("Manufacturer", "Model", "Consumption", "Colour", "URL", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["Manufacturer", "troll"], ["Model", "123"], ["Consumption", 4.5], ["Colour", ""], ["URL", ""], ["created_at", "2017-06-21 22:12:54.265481"], ["updated_at", "2017-06-21 22:12:54.265481"]]

  def update
    respond_to do |format|
      if @car.update(car_params)
---
UPDATE "cars" SET "Colour" = ?, "YearOfRelease" = ?, "Doors" = ?, "URL" = ?, "updated_at" = ? WHERE "cars"."id" = ?

  def destroy
    @car.destroy
---
DELETE FROM "cars" WHERE "cars"."id" = ?  [["id", 2]]

    def set_car
      @car = Car.find(params[:id])
---
SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]